/*
 * Copyright (c) 2021-2023 HPMicro
 *
 * SPDX-License-Identifier: BSD-3-Clause
 *
 */


#ifndef HPM_SMIX_H
#define HPM_SMIX_H

typedef struct {
    __R  uint32_t DMAC_ID;                     /* 0x0: DMAC_ID Register */
    __RW uint32_t DMAC_TC_ST;                  /* 0x4: Transfer Complete Status */
    __RW uint32_t DMAC_ABRT_ST;                /* 0x8: Transfer Abort Status */
    __RW uint32_t DMAC_ERR_ST;                 /* 0xC: Transfer Error Status */
    __R  uint8_t  RESERVED0[16];               /* 0x10 - 0x1F: Reserved */
    __RW uint32_t DMAC_CTRL;                   /* 0x20: Control Register */
    __W  uint32_t DMAC_ABRT_CMD;               /* 0x24: Abort Command Register */
    __R  uint8_t  RESERVED1[12];               /* 0x28 - 0x33: Reserved */
    __RW uint32_t DMAC_CHEN;                   /* 0x34: Channel Enable Register */
    __R  uint8_t  RESERVED2[8];                /* 0x38 - 0x3F: Reserved */
    struct {
        __RW uint32_t DMAC_CHCTL_N;            /* 0x40: Channel N Control Register */
        __RW uint32_t DMAC_TTBEAT_N;           /* 0x44: Channel N Source Total Beats Register */
        __RW uint32_t DMAC_SRCADDR_N;          /* 0x48: Channel N Source Register */
        __R  uint8_t  RESERVED0[4];            /* 0x4C - 0x4F: Reserved */
        __RW uint32_t DMAC_DSTADDR_N;          /* 0x50: Channel N Destination Register */
        __R  uint8_t  RESERVED1[4];            /* 0x54 - 0x57: Reserved */
        __RW uint32_t DMAC_LLP_N;              /* 0x58: Channel N Linked List Pointer Register */
        __R  uint8_t  RESERVED2[4];            /* 0x5C - 0x5F: Reserved */
    } CH[26];
    __R  uint8_t  RESERVED3[128];              /* 0x380 - 0x3FF: Reserved */
    __RW uint32_t SRC_CTRL;                    /* 0x400: SRC Control Register */
    __RW uint32_t SRC_MISCFG;                  /* 0x404: SRC Misc Configuration Register */
    __RW uint32_t SRC_STA;                     /* 0x408: SRC Status Register */
    __RW uint32_t SRC_PERIOD;                  /* 0x40C: SRC Period Register */
    __W  uint32_t SRC_ONESHOT_CMD;             /* 0x410: SRC FIFO Resync Register */
    __R  uint8_t  RESERVED4[28];               /* 0x414 - 0x42F: Reserved */
    struct {
        __RW uint32_t SRC_PCTRLN;              /* 0x430: SRC Pair N Control Register */
        __RW uint32_t SRC_DFMT_CTRLN;          /* 0x434: SRC Pair N Data Format Register */
        __RW uint32_t SRC_CCTRLN;              /* 0x438: SRC Pair N Clock Control Register */
        __R  uint32_t SRC_PSTN;                /* 0x43C: SRC Pair N Status Register */
        __RW uint32_t SRC_IDRTN;               /* 0x440: SRC Pair N Ideal Ratio Register */
        __RW uint32_t SRC_ACTRTN;              /* 0x444: SRC Pair N Actual Ratio Register */
        __RW uint32_t SRC_DIN;                 /* 0x448: SRC Pair N Data Input Register */
        __RW uint32_t SRC_DON;                 /* 0x44C: SRC Pair N Data Output Register */
    } PCH[3];
    __R  uint8_t  RESERVED5[880];              /* 0x490 - 0x7FF: Reserved */
    __RW uint32_t SMIX_CALSAT_ST;              /* 0x800: SMIX Cal Saturation Status Register */
    __RW uint32_t SMIX_FDOT_DONE_ST;           /* 0x804: SMIX Fade-Out Done Status Register */
    __R  uint32_t SMIX_DATA_ST;                /* 0x808: SMIX Data Status Register */
    __R  uint8_t  RESERVED6[52];               /* 0x80C - 0x83F: Reserved */
    struct {
        __RW uint32_t SMIX_DSTN_CTRL;          /* 0x840: SMIX Dstination N Control Register */
        __RW uint32_t SMIX_DSTN_GAIN;          /* 0x844: SMIX Dstination N Gain Register */
        __RW uint32_t SMIX_DSTN_MIDX;          /* 0x848: SMIX Dstination N Max Index Register */
        __RW uint32_t SMIX_DSTN_FADEIN;        /* 0x84C: SMIX Dstination N Fade-In Configuration Register */
        __RW uint32_t SMIX_DSTN_FADEOUT;       /* 0x850: SMIX Dstination N Fade-Out Configuration Register */
        __R  uint32_t SMIX_DSTN_ST;            /* 0x854: SMIX Dstination N Status Register */
        __R  uint32_t SMIX_DSTN_DATA;          /* 0x858: SMIX Dstination N Data Out Register */
        __R  uint8_t  RESERVED0[4];            /* 0x85C - 0x85F: Reserved */
        __RW uint32_t SMIX_DSTN_SRC_EN;        /* 0x860: SMIX Dstination N Source Enable Register */
        __RW uint32_t SMIX_DSTN_SRC_ACT;       /* 0x864: SMIX Dstination N Source Activation Register */
        __RW uint32_t SMIX_DSTN_SRC_DEACT;     /* 0x868: SMIX Dstination N Source De-Activation Register */
        __RW uint32_t SMIX_DSTN_SRC_FADEIN_CTRL; /* 0x86C: SMIX Dstination N Source Fade-in Control Register */
        __R  uint32_t SMIX_DSTN_SRC_DEACT_ST;  /* 0x870: SMIX Dstination N Source Deactivation Status Register */
        __RW uint32_t SMIX_DSTN_SRC_MFADEOUT_CTRL; /* 0x874: SMIX Dstination N Source Manual Fade-out Control Register */
        __R  uint8_t  RESERVED1[8];            /* 0x878 - 0x87F: Reserved */
    } SMIX_DCH[2];
    __R  uint8_t  RESERVED7[64];               /* 0x8C0 - 0x8FF: Reserved */
    struct {
        __RW uint32_t SMIX_SRCN_CTRL;          /* 0x900: SMIX Source N Control Register */
        __RW uint32_t SMIX_SRCN_GAIN;          /* 0x904: SMIX Source N Gain Register */
        __RW uint32_t SMIX_SRCN_FADEIN;        /* 0x908: SMIX Source N Fade-in Control Register */
        __RW uint32_t SMIX_SRCN_FADEOUT;       /* 0x90C: SMIX Source N Fade-out Control Register */
        __RW uint32_t SMIX_SRCN_BUFSIZE;       /* 0x910: SMIX Source N Buffer Size Register */
        __RW uint32_t SMIX_SRCN_ST;            /* 0x914: SMIX Source N Status Register */
        __W  uint32_t SMIX_SRCN_DATA;          /* 0x918: SMIX Source N Data Input Register */
        __R  uint8_t  RESERVED0[4];            /* 0x91C - 0x91F: Reserved */
    } SMIX_SCH[14];
} SMIX_Type;


/* Bitfield definition for register: DMAC_ID */
/*
 * REV (RO)
 *
 * Revision
 */
#define SMIX_DMAC_ID_REV_MASK (0x7FFFFUL)
#define SMIX_DMAC_ID_REV_SHIFT (0U)
#define SMIX_DMAC_ID_REV_GET(x) (((uint32_t)(x) & SMIX_DMAC_ID_REV_MASK) >> SMIX_DMAC_ID_REV_SHIFT)

/* Bitfield definition for register: DMAC_TC_ST */
/*
 * CH (W1C)
 *
 * The terminal count status is set when a channel transfer finishes without abort or error events
 */
#define SMIX_DMAC_TC_ST_CH_MASK (0x3FFFFFFUL)
#define SMIX_DMAC_TC_ST_CH_SHIFT (0U)
#define SMIX_DMAC_TC_ST_CH_SET(x) (((uint32_t)(x) << SMIX_DMAC_TC_ST_CH_SHIFT) & SMIX_DMAC_TC_ST_CH_MASK)
#define SMIX_DMAC_TC_ST_CH_GET(x) (((uint32_t)(x) & SMIX_DMAC_TC_ST_CH_MASK) >> SMIX_DMAC_TC_ST_CH_SHIFT)

/* Bitfield definition for register: DMAC_ABRT_ST */
/*
 * CH (W1C)
 *
 * The abort status is set when a channel transfer is aborted
 */
